&НаКлиенте
Перем ИдентификаторКомпоненты, ВнешняяКомпонента, АдресПодключения;

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНовыйИдентификатор()
	
	Возврат "X" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуЗапуска(ИдентификаторКлиента)
	
	Возврат "http://localhost/demo/?N=Администратор&P=&L=ru&VL=ru&DisableStartupMessages&DisplayAllFunctions&EnableCheckModal&O=Normal&TESTCLIENT&TESTCLIENTID=" + ИдентификаторКлиента;
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетКомпоненты = РеквизитФормыВЗначение("Объект").ПолучитьМакет("WebSocket");
	JavaScript = РеквизитФормыВЗначение("Объект").ПолучитьМакет("JavaScript").ПолучитьТекст();
	МестоположениеКомпоненты = ПоместитьВоВременноеХранилище(МакетКомпоненты, УникальныйИдентификатор);
	
	ИдентификаторКлиента = ПолучитьНовыйИдентификатор();
	АдресКлиента = ПолучитьСтрокуЗапуска(ИдентификаторКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИдентификаторКомпоненты = ПолучитьНовыйИдентификатор();
	ВыполнитьПодключениеВнешнейКомпоненты(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодключениеВнешнейКомпоненты(ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключениеВнешнейКомпонентыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеВнешнейКомпоненты(ОписаниеОповещения, МестоположениеКомпоненты, ИдентификаторКомпоненты, ТипВнешнейКомпоненты.Native); 
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодключениеВнешнейКомпонентыЗавершение(Подключение, ДополнительныеПараметры) Экспорт
	
	Если Подключение Тогда
		ВнешняяКомпонента = Новый("AddIn." + ИдентификаторКомпоненты + ".Client");
	ИначеЕсли ДополнительныеПараметры = Истина Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПодключениеВнешнейКомпоненты", ЭтотОбъект, Ложь);
		НачатьУстановкуВнешнейКомпоненты(ОписаниеОповещения, МестоположениеКомпоненты);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗапуститьБраузер(Команда)
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения, """C:\Program Files (x86)\Google\Chrome\Application\chrome.exe"" --remote-debugging-port=9222");
	
КонецПроцедуры

&НаКлиенте
Процедура СтартКлиента(Команда)
	
	АдресКлиента = "http://ya.ru";
	
	HTTPЗапрос = Новый HTTPЗапрос("/json/new?" + АдресКлиента);
	
	HTTPСоединение = Новый HTTPСоединение("localhost", 9222, , , , 10);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	ххТекстJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ххТекстJSON);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	Сообщить(ДанныеJSON.webSocketDebuggerUrl);
	АдресПодключения = ДанныеJSON.webSocketDebuggerUrl;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСкриншот(Команда)

	ВнешняяКомпонента = Новый("AddIn." + ИдентификаторКомпоненты + ".Client");
	ОписаниеОповещения = Новый ОписаниеОповещения("ScreenshotВыполненоПодключение", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовПодключиться(ОписаниеОповещения, АдресПодключения);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ScreenshotВыполненоПодключение(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ТекстJSON = "{""id"":1,""method"":""Page.captureScreenshot"",""params"":{""format"":""png"",""quality"":85,""fromSurface"":false}}";
	
	
	ПараметрыМетода = Новый Структура("format,quality,fromSurface", "png", 85, Ложь);
	ДанныеJSON = Новый Структура("id,method,params", 1, "Page.captureScreenshot", ПараметрыМетода);
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ScreenshotВыполненаОтправка", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовОтправить(ОписаниеОповещения, ТекстJSON);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ScreenshotВыполненаОтправка(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ScreenshotВыполненПрием", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовПринять(ОписаниеОповещения, 0, Неопределено);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ScreenshotВыполненПрием(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ВнешняяКомпонента.НачатьВызовОтключиться(Новый ОписаниеОповещения);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПараметрыВызова[1]);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	ДвоичныеДанные = Base64Значение(ДанныеJSON.result.data);
	Картинка = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьJavaScript(Команда)

	ВнешняяКомпонента = Новый("AddIn." + ИдентификаторКомпоненты + ".Client");
	ОписаниеОповещения = Новый ОписаниеОповещения("SctiptВыполненоПодключение", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовПодключиться(ОписаниеОповещения, АдресПодключения);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура SctiptВыполненоПодключение(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	//{"id": 1, "method": "Runtime.evaluate", "params": {"expression": "alert('test')"}}
	
	
	ПараметрыМетода = Новый Структура("expression", JavaScript);
	ДанныеJSON = Новый Структура("id,method,params", 1, "Runtime.evaluate", ПараметрыМетода);
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("SctiptВыполненаОтправка", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовОтправить(ОписаниеОповещения, ТекстJSON);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура SctiptВыполненаОтправка(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("SctiptВыполненПрием", ЭтотОбъект);
	ВнешняяКомпонента.НачатьВызовПринять(ОписаниеОповещения, 0, Неопределено);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура SctiptВыполненПрием(РезультатВызова, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	
	ВнешняяКомпонента.НачатьВызовОтключиться(Новый ОписаниеОповещения);
	
КонецПроцедуры

